export default {
  ws: {
    createTitle: 'Создание рабочего пространства',
    nameLabel: 'Введите имя пространства',
    urlLabel: 'URL рабочего пространства',
    urlTaken: 'Данный URL уже занят',
    validation: {
      nameMin: 'Название должно содержать 3 или более символов',
      slugMin: 'Идентификатор должен содержать 3 и более символов',
      slugKebab:
        'Разрешены только строчные буквы латинского алфавита, цифры и дефисы',
      slugRestricted: 'Недопустимое системное имя пространства',
    },
  },
  project: {
    createTitle: 'Создание нового проекта',
    nameLabel: 'Введите имя проекта',
    identifierLabel: 'Введите идентификатор проекта',
    visibility: { hidden: 'Скрытый', public: 'Публичный' },
    validation: {
      nameMin: 'Название должно содержать 1 или более символов',
      identifierMin: 'Идентификатор должен содержать {min} и более символов',
    },
  },
  closeConfirm: {
    wsTitle: 'Закрыть создание пространства',
    projectTitle: 'Закрыть создание проекта',
    body: 'Вы уверены, что хотите закрыть окно? Все внесенные данные будут утеряны.',
    back: 'Вернуться',
  },
};
